bobmittmann/thinkos/board/stm32f405-dk/src/boot/usb_comm_dual.c
/* 
 * File:	 usb-cdc.c
 * Author:   Robinson Mittmann (bobmittmann@gmail.com)
 * Target:
 * Comment:
 * Copyright(C) 2011 Bob Mittmann. All Rights Reserved.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
 */

#include <sys/stm32f.h>
#include <arch/cortex-m3.h>
#include <sys/param.h>
#include <sys/serial.h>
#include <string.h>
#include <stdbool.h>
#include <assert.h>

#include <sys/usb-dev.h>
#include <sys/usb-cdc.h>

#include <sys/dcclog.h>

#define __THINKOS_DBGMON__
#include <thinkos/dbgmon.h>

#if (THINKOS_ENABLE_MONITOR)

#ifndef THINKOS_DBGMON_ENABLE_FLOWCTL
#define THINKOS_DBGMON_ENABLE_FLOWCTL 1 
#endif

#if THINKOS_DBGMON_ENABLE_COMM_STATS
#define THINKOS_DBGMON_ENABLE_COMM_STATS 0
#endif

#define EP0_ADDR 0
#define EP0_MAX_PKT_SIZE 64

#define EP_OUT0_ADDR 1
#define EP_IN0_ADDR  2
#define EP_INT0_ADDR 3

#define EP_OUT0_ADDR 4
#define EP_IN0_ADDR  5
#define EP_INT0_ADDR 6

#ifndef CDC_EP_OUT_MAX_PKT_SIZE
#define CDC_EP_OUT_MAX_PKT_SIZE 64
#endif

#ifndef CDC_EP_IN_MAX_PKT_SIZE 
#define CDC_EP_IN_MAX_PKT_SIZE 64
#endif

#ifndef CDC_EP_INT_MAX_PKT_SIZE 
#define CDC_EP_INT_MAX_PKT_SIZE 64
#endif

struct cdc_acm_descriptor_config {
	struct usb_descriptor_configuration cfg;
	struct usb_descriptor_interface comm_if;
	struct cdc_header_descriptor hdr;
	struct cdc_call_management_descriptor cm;
	struct cdc_abstract_control_management_descriptor acm;
	struct cdc_union_1slave_descriptor un;
	struct usb_descriptor_endpoint ep_int;
	struct usb_descriptor_interface if_data;
	struct usb_descriptor_endpoint ep_out;
	struct usb_descriptor_endpoint ep_in;
} __attribute__((__packed__));

struct dual_cdc_acm_descriptor_set {
	struct usb_descriptor_configuration cfg;

	struct usb_descriptor_interface_association ia0;
	struct usb_descriptor_interface if0;
	struct cdc_header_descriptor hdr0;
	struct cdc_call_management_descriptor cm0;
	struct cdc_abstract_control_management_descriptor acm0;
	struct cdc_union_1slave_descriptor un0;
	struct usb_descriptor_endpoint ep_int0;
	struct usb_descriptor_interface if_data0;
	struct usb_descriptor_endpoint ep_out0;
	struct usb_descriptor_endpoint ep_in0;

	struct usb_descriptor_interface_association ia1;
	struct usb_descriptor_interface if1;
	struct cdc_header_descriptor hdr1;
	struct cdc_call_management_descriptor cm1;
	struct cdc_abstract_control_management_descriptor acm1;
	struct cdc_union_1slave_descriptor un1;
	struct usb_descriptor_endpoint ep_int1;
	struct usb_descriptor_interface if_data1;
	struct usb_descriptor_endpoint ep_out1;
	struct usb_descriptor_endpoint ep_in1;
} __attribute__((__packed__));

#define ATMEL_VCOM_PRODUCT_ID 0x6119
#define ST_VCOM_PRODUCT_ID    0x5740

#ifndef CDC_ACM_PRODUCT_ID
#define CDC_ACM_PRODUCT_ID ST_VCOM_PRODUCT_ID 
#endif

static const struct usb_descriptor_device dual_cdc_acm_desc_dev = {
		/* Size of this descriptor in bytes */
		sizeof(struct usb_descriptor_device),
		/* DEVICE descriptor type */
		USB_DESCRIPTOR_DEVICE,
		/* USB specification release number */
		USB1_10,
		/* Class code */
		USB_CLASS_MISCELLANEOUS,
		/* Subclass code */
		0x02,
		/* Protocol code */
		0x01,
		/* Control endpoint 0 max. packet size */
		EP0_MAX_PKT_SIZE,
		/* Vendor ID */
		USB_VENDOR_ST,
		/* Product ID */
		CDC_ACM_PRODUCT_ID,
		/* Device release number */
		0x0002,
		/* Index of manufacturer string descriptor */
		0x00,
		/* Index of product string descriptor */
		0x01,
		/* Index of S.N.  string descriptor */
		0x00,
		/* Number of possible configurations */
		0x01
};

#define DUAL_CDC_IF0 0
#define DUAL_CDC_IF1 2

/* Configuration 1 descriptor */
static const struct dual_cdc_acm_descriptor_set dual_cdc_acm_desc_cfg = {
		.cfg = {
			sizeof(struct usb_descriptor_configuration),
			USB_DESCRIPTOR_CONFIGURATION,
			sizeof(struct dual_cdc_acm_descriptor_set),
			/* Number of interfaces for this configuration */
			4,
			/* Value to use as an argument for the
			   Set Configuration request to select this configuration */
			1,
			/* Index of string descriptor describing this configuration */
			0,
			/* Configuration characteristics - attributes */
			USB_CONFIG_SELF_NOWAKEUP,
			/* Maximum power consumption of the device */
			USB_POWER_MA(250)
		},

		/* CDC 0 */
		/* Interface Association Descriptor */
		.ia0 = {
			/* Size of this descriptor in bytes */
			.length = sizeof(struct usb_descriptor_interface_association),
			/* INTERFACE_ASSOCIATION descriptor type */
			.descriptortype = USB_DESCRIPTOR_INTERFACE_ASSOCIATION,
			/* First Interface . */
			.first_interface = DUAL_CDC_IF0,
			/* Interface Count. */
			.interface_count = 2,
			/* Class code */
			.function_class = CDC_INTERFACE_COMMUNICATION,
			/* Sub-class */
			.function_subclass = CDC_ABSTRACT_CONTROL_MODEL,
			/* Protocol code: no protocol */
			.function_protocol = CDC_PROTOCOL_NONE,
			/* Index of the function string descriptor */
			.function = 0
		},
		/* Communication Class Interface Descriptor */
		.if0 = {
			.length = sizeof(struct usb_descriptor_interface),
			.type = USB_DESCRIPTOR_INTERFACE,
			.number = DUAL_CDC_IF0,
			.alt_setting = 0,
			.num_endpoints = 1,
			.ceclass = CDC_INTERFACE_COMMUNICATION,
			.esubclass = CDC_ABSTRACT_CONTROL_MODEL,
			.protocol = CDC_PROTOCOL_NONE,
			.interface = 0
		},
		/* Header Functional Descriptor */
		.hdr0 = {
			.bFunctionLength = sizeof(struct cdc_header_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_HEADER,
			.bcdCDC = CDC1_10
		},
		/* Call Management Functional Descriptor */
		.cm0 = {
			.bFunctionLength = sizeof(struct cdc_call_management_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_CALL_MANAGEMENT,
			.bmCapabilities = CDC_CALL_MANAGEMENT_SELF,
			/* interface used for call management */
			.bDataInterface = DUAL_CDC_IF0 + 1
		},
		/* Abstract Control Management Functional Descriptor */
		.acm0 = {
			.bFunctionLength = 
				sizeof(struct cdc_abstract_control_management_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_ABSTRACT_CONTROL_MANAGEMENT,
			.bmCapabilities = CDC_ACM_COMMFEATURE + CDC_ACM_LINE + 
				CDC_ACM_SENDBREAK
		},
		/* Union Functional Descriptor */
		.un0 = {
			.bFunctionLength = sizeof(struct cdc_union_1slave_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_UNION,
			.bMasterInterface = DUAL_CDC_IF0,
			.bSlaveInterface = DUAL_CDC_IF0 + 1
		},
		/* Endpoint 3 descriptor */
		.ep_int0 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress= USB_ENDPOINT_IN + EP_INT0_ADDR,
			.attributes = ENDPOINT_TYPE_INTERRUPT,
			.maxpacketsize = CDC_EP_INT_MAX_PKT_SIZE,
			.interval = 100
		},
		/* Data Class Interface Descriptor Requirement */
		.if_data0 = {
			/* Size of this descriptor in bytes */
			.length = sizeof(struct usb_descriptor_interface),
			/* INTERFACE descriptor type */
			.type = USB_DESCRIPTOR_INTERFACE,
			/* Number of this interface */
			.number = DUAL_CDC_IF0 + 1,
			/* Value used to select this alternate setting */
			.alt_setting = 0,
			/* Number of endpoints used by this interface
			   (excluding endpoint zero) */
			.num_endpoints = 2,
			/* Class code */
			.ceclass =  CDC_INTERFACE_CLASS_DATA,
			/* Sub-class */
			.esubclass = CDC_INTERFACE_SUBCLASS_DATA,
			/* Protocol code */
			.protocol = CDC_PROTOCOL_NONE,
			/* Index of string descriptor describing this interface */
			.interface = DUAL_CDC_IF0
		},
		/* First alternate setting */
		/* Endpoint 1 descriptor */
		.ep_out0 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress = USB_ENDPOINT_OUT + EP_OUT0_ADDR,
			.attributes = ENDPOINT_TYPE_BULK,
			.maxpacketsize = CDC_EP_OUT_MAX_PKT_SIZE,
			.interval = 0
		},
		/* Endpoint 2 descriptor */
		.ep_in0 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress= USB_ENDPOINT_IN + EP_IN0_ADDR,
			.attributes = ENDPOINT_TYPE_BULK,
			.maxpacketsize = CDC_EP_IN_MAX_PKT_SIZE,
			.interval = 0
		}




