bobmittmann/thinkos/board/stm32f405-dk/src/boot/usb_comm_dual.c
		/* CDC 1 */
		/* Interface Association Descriptor */
		.ia1 = {
			/* Size of this descriptor in bytes */
			.length = sizeof(struct usb_descriptor_interface_association),
			/* INTERFACE_ASSOCIATION descriptor type */
			.descriptortype = USB_DESCRIPTOR_INTERFACE_ASSOCIATION,
			/* First Interface . */
			.first_interface = DUAL_CDC_IF0,
			/* Interface Count. */
			.interface_count = 2,
			/* Class code */
			.function_class = CDC_INTERFACE_COMMUNICATION,
			/* Sub-class */
			.function_subclass = CDC_ABSTRACT_CONTROL_MODEL,
			/* Protocol code: no protocol */
			.function_protocol = CDC_PROTOCOL_NONE,
			/* Index of the function string descriptor */
			.function = 0
		},
		/* Communication Class Interface Descriptor */
		.if1 = {
			.length = sizeof(struct usb_descriptor_interface),
			.type = USB_DESCRIPTOR_INTERFACE,
			.number = DUAL_CDC_IF1,
			.alt_setting = 0,
			.num_endpoints = 1,
			.ceclass = CDC_INTERFACE_COMMUNICATION,
			.esubclass = CDC_ABSTRACT_CONTROL_MODEL,
			.protocol = CDC_PROTOCOL_NONE,
			.interface = 0
		},
		/* Header Functional Descriptor */
		.hdr1 = {
			.bFunctionLength = sizeof(struct cdc_header_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_HEADER,
			.bcdCDC = CDC1_10
		},
		/* Call Management Functional Descriptor */
		.cm1 = {
			.bFunctionLength = sizeof(struct cdc_call_management_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_CALL_MANAGEMENT,
			.bmCapabilities = CDC_CALL_MANAGEMENT_SELF,
			/* interface used for call management */
			.bDataInterface = DUAL_CDC_IF1 + 1
		},
		/* Abstract Control Management Functional Descriptor */
		.acm1 = {
			.bFunctionLength = 
				sizeof(struct cdc_abstract_control_management_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_ABSTRACT_CONTROL_MANAGEMENT,
			.bmCapabilities = CDC_ACM_COMMFEATURE + CDC_ACM_LINE + 
				CDC_ACM_SENDBREAK
		},
		/* Union Functional Descriptor */
		.un1 = {
			.bFunctionLength = sizeof(struct cdc_union_1slave_descriptor),
			.bDescriptorType = CDC_CS_INTERFACE,
			.bDescriptorSubtype = CDC_UNION,
			.bMasterInterface = DUAL_CDC_IF1,
			.bSlaveInterface = DUAL_CDC_IF1 + 1
		},
		/* Endpoint 3 descriptor */
		.ep_int1 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress= USB_ENDPOINT_IN + EP_INT1_ADDR,
			.attributes = ENDPOINT_TYPE_INTERRUPT,
			.maxpacketsize = CDC_EP_INT_MAX_PKT_SIZE,
			.interval = 100
		},
		/* Data Class Interface Descriptor Requirement */
		.if_data1 = {
			/* Size of this descriptor in bytes */
			.length = sizeof(struct usb_descriptor_interface),
			/* INTERFACE descriptor type */
			.type = USB_DESCRIPTOR_INTERFACE,
			/* Number of this interface */
			.number = DUAL_CDC_IF1 + 1,
			/* Value used to select this alternate setting */
			.alt_setting = 0,
			/* Number of endpoints used by this interface
			   (excluding endpoint zero) */
			.num_endpoints = 2,
			/* Class code */
			.ceclass =  CDC_INTERFACE_CLASS_DATA,
			/* Sub-class */
			.esubclass = CDC_INTERFACE_SUBCLASS_DATA,
			/* Protocol code */
			.protocol = CDC_PROTOCOL_NONE,
			/* Index of string descriptor describing this interface */
			.interface = DUAL_CDC_IF1
		},
		/* First alternate setting */
		/* Endpoint 1 descriptor */
		.ep_out1 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress = USB_ENDPOINT_OUT + EP_OUT1_ADDR,
			.attributes = ENDPOINT_TYPE_BULK,
			.maxpacketsize = CDC_EP_OUT_MAX_PKT_SIZE,
			.interval = 0
		},
		/* Endpoint 2 descriptor */
		.ep_in1 = {
			.length = sizeof(struct usb_descriptor_endpoint),
			.type = USB_DESCRIPTOR_ENDPOINT,
			.endpointaddress= USB_ENDPOINT_IN + EP_IN1_ADDR,
			.attributes = ENDPOINT_TYPE_BULK,
			.maxpacketsize = CDC_EP_IN_MAX_PKT_SIZE,
			.interval = 0
		}
};


#define CDC_STOP_BITS_1   (0 << 0)
#define CDC_STOP_BITS_1_5 (1 << 0)
#define CDC_STOP_BITS_2   (2 << 0)
#define CDC_STOP_BITS_ERR (3 << 0)
#define CDC_CHAR_FORMAT_SET(VAL)  (((VAL) & 0x3) << 0)
#define CDC_CHAR_FORMAT_GET(VAL)  (((VAL) >> 0) & 0x3)
#define CDC_STOP_BITS_MAX 2

#define CDC_PARITY_NONE   (0 << 2)
#define CDC_PARITY_ODD    (1 << 2)
#define CDC_PARITY_EVEN   (2 << 2)
#define CDC_PARITY_MARK   (3 << 2)
#define CDC_PARITY_SPACE  (4 << 2)
#define CDC_PARITY_ERR    (7 << 2)
#define CDC_PARITY_SET(VAL)  (((VAL) & 0x7) << 2)
#define CDC_PARITY_GET(VAL)  (((VAL) >> 2) & 0x7)
#define CDC_PARITY_MAX    4

#define CDC_DATA_BITS_5   (0 << 5)
#define CDC_DATA_BITS_6   (1 << 5)
#define CDC_DATA_BITS_7   (2 << 5)
#define CDC_DATA_BITS_8   (3 << 5)
#define CDC_DATA_BITS_16  (4 << 5)
#define CDC_DATA_BITS_ERR (7 << 5)
#define CDC_DATA_BITS_SET(VAL)  data_bit_lut[(VAL) & 0x1f]
#define CDC_DATA_BITS_GET(VAL)  data_bit_rev_lut[((VAL) >> 5) & 0x7]
#define CDC_DATA_BITS_MAX 16


#define LANG_STR_SZ              4
/* LangID = 0x0409: U.S. English */
static const uint8_t cdc_acm_lang_str[LANG_STR_SZ] = {
	LANG_STR_SZ, USB_DESCRIPTOR_STRING,
	0x09, 0x04
};

#define VENDOR_STR_SZ            38
static const uint8_t cdc_acm_vendor_str[VENDOR_STR_SZ] = {
	VENDOR_STR_SZ, USB_DESCRIPTOR_STRING,
	/* Manufacturer: "STMicroelectronics" */
	'S', 0, 'T', 0, 'M', 0, 'i', 0, 'c', 0, 'r', 0, 'o', 0, 'e', 0, 'l', 0, 
	'e', 0, 'c', 0, 't', 0, 'r', 0, 'o', 0, 'n', 0, 'i', 0, 'c', 0, 's', 0
};


#define PRODUCT_STR_SZ           44
static const uint8_t cdc_acm_product_str[PRODUCT_STR_SZ] = {
	PRODUCT_STR_SZ, USB_DESCRIPTOR_STRING,
	/* Product name: "ThinkOS Debug Monitor" */
	'T', 0, 'h', 0, 'i', 0, 'n', 0, 'k', 0, 'O', 0, 'S', 0, ' ', 0, 'D', 0, 
	'e', 0, 'b', 0, 'u', 0, 'g', 0, ' ', 0, 'M', 0, 'o', 0, 'n', 0, 'i', 0, 
	't', 0, 'o', 0, 'r', 0,
};

#define SERIAL_STR_SZ            30
static const uint8_t cdc_acm_serial_str[SERIAL_STR_SZ] = {
	SERIAL_STR_SZ, USB_DESCRIPTOR_STRING,
	/* Serial number: "54 68 69 6e 6b 4f 53" */
	'5', 0, '4', 0, '6', 0, '8', 0, '6', 0, '9', 0, '6', 0, 'E', 0, 
	'6', 0, 'B', 0, '4', 0, 'F', 0, '5', 0, '3', 0
};

#define INTERFACE_STR_SZ         16
static const uint8_t cdc_acm_interface_str[INTERFACE_STR_SZ] = {
	INTERFACE_STR_SZ, USB_DESCRIPTOR_STRING,
	/* Interface 0: "ST VCOM" */
	'S', 0, 'T', 0, ' ', 0, 'V', 0, 'C', 0, 'O', 0, 'M', 0
};

static const uint8_t * const cdc_acm_str[] = {
	cdc_acm_lang_str,
	cdc_acm_vendor_str,
	cdc_acm_product_str,
	cdc_acm_serial_str,
	cdc_acm_interface_str
};

