bobmittmann/thinkos/board/stm32f405-dk/src/boot/usb_comm_dual.c
#define USB_STRCNT() (sizeof(cdc_acm_str) / sizeof(uint8_t *))

static const struct cdc_line_coding usb_cdc_lc = {
    .dwDTERate = 38400,
    .bCharFormat = 0,
    .bParityType = 0,
    .bDataBits = 8
};

static const uint16_t device_status = USB_DEVICE_STATUS_SELF_POWERED;
static const uint16_t interface_status = 0x0000;


#define ACM_USB_SUSPENDED (1 << 1)
#define ACM_CONNECTED     (1 << 2)

#define CDC_CTL_BUF_LEN 16

struct usb_cdc_acm_dev {
	/* underling USB device */
	struct usb_dev * usb;
	/* endpoints handlers */
	uint8_t ctl_ep;
	uint8_t in_ep;
	uint8_t out_ep;
	uint8_t int_ep;

	uint8_t configured;
	uint32_t ctl_buf[CDC_CTL_BUF_LEN / 4];

	volatile uint8_t acm_ctrl; /* modem control lines */

	volatile uint32_t tx_seq; 
	volatile uint32_t tx_ack; 

	volatile uint32_t rx_seq; 
	volatile uint32_t rx_ack; 
#if THINKOS_DBGMON_ENABLE_FLOWCTL
	uint8_t rx_flowctrl;
	uint8_t rx_paused;
#endif
	volatile uint8_t rx_cnt; 
	volatile uint8_t rx_pos; 
	uint8_t rx_buf[CDC_EP_IN_MAX_PKT_SIZE];

#if THINKOS_DBGMON_ENABLE_COMM_STATS
	struct {
		uint32_t tx_pkt;
		uint32_t rx_pkt;
	} stats;
#endif

};

static void usb_mon_on_rcv(usb_class_t * cl, 
						   unsigned int ep_id, unsigned int len)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)cl;
	DCC_LOG1(LOG_MSG, "COMM_RCV! %d", len);
	dev->rx_seq += len;
	dbgmon_signal(DBGMON_COMM_RCV);
}

static void usb_mon_on_eot(usb_class_t * cl, unsigned int ep_id)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)cl;
	dev->tx_ack++;
	DCC_LOG(LOG_MSG, "COMM_EOT");
	dbgmon_signal(DBGMON_COMM_EOT);
}

static void usb_mon_on_eot_int(usb_class_t * cl, unsigned int ep_id)
{
	DCC_LOG1(LOG_MSG, "ep_id=%d", ep_id);
}

static const usb_dev_ep_info_t usb_mon_in_info = {
	.addr = USB_ENDPOINT_IN + EP_IN_ADDR,
	.attr = ENDPOINT_TYPE_BULK,
	.mxpktsz = CDC_EP_IN_MAX_PKT_SIZE,
	.on_in = usb_mon_on_eot
};

static const usb_dev_ep_info_t usb_mon_out_info = {
	.addr = USB_ENDPOINT_OUT + EP_OUT_ADDR,
	.attr = ENDPOINT_TYPE_BULK,
	.mxpktsz = CDC_EP_OUT_MAX_PKT_SIZE,
	.on_out = usb_mon_on_rcv
};

static const usb_dev_ep_info_t usb_mon_int_info = {
	.addr = USB_ENDPOINT_IN + EP_INT_ADDR,
	.attr = ENDPOINT_TYPE_INTERRUPT,
	.mxpktsz = CDC_EP_INT_MAX_PKT_SIZE,
	.on_in = usb_mon_on_eot_int
};

/* Setup requests callback handler */
static int usb_mon_on_setup(usb_class_t * cl, struct usb_request * req, void ** ptr) 
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *) cl;
	int value = req->value;
	int index = req->index;
	int len = 0;
	int desc;

	(void)index;

	/* Handle supported standard device request Cf
	 Table 9-3 in USB specification Rev 1.1 */

	switch ((req->request << 8) | req->type) {

	/* Standard Device Requests */
		
	case STD_GET_DESCRIPTOR:
		desc = value >> 8;

		if (desc == USB_DESCRIPTOR_DEVICE) {
			/* Return Device Descriptor */
			*ptr = (void *)&cdc_acm_desc_dev;
			len = sizeof(struct usb_descriptor_device);
			DCC_LOG1(LOG_TRACE, "GetDesc: Device: len=%d", len);
			break;
		}

		if (desc == USB_DESCRIPTOR_CONFIGURATION) {
			/* Return Configuration Descriptor */
			*ptr = (void *)&dual_cdc_acm_desc_cfg;
			len = sizeof(struct dual_cdc_acm_descriptor_config);
			DCC_LOG1(LOG_TRACE, "GetDesc: Config: len=%d", len);
			break;
		}

		if (desc == USB_DESCRIPTOR_STRING) {
			int n = value & 0xff;
			DCC_LOG1(LOG_TRACE, "GetDesc: String[%d]", n);
			if (n < USB_STRCNT()) {
				*ptr = (void *)cdc_acm_str[n];
				len = cdc_acm_str[n][0];
			}
			break;
		}
		len = -1;
		DCC_LOG1(LOG_TRACE, "GetDesc: %d ?", desc);
		break;

	case STD_SET_ADDRESS:
		DCC_LOG1(LOG_TRACE, "SetAddr: %d [ADDRESS]", value);
		break;

	case STD_SET_CONFIGURATION: {
		DCC_LOG1(LOG_TRACE, "SetCfg: %d", value);
		if (value) {
			dev->in_ep = usb_dev_ep_init(dev->usb, &usb_mon_in_info, NULL, 0);
			dev->out_ep = usb_dev_ep_init(dev->usb, &usb_mon_out_info, NULL, 0);
			dev->int_ep = usb_dev_ep_init(dev->usb, &usb_mon_int_info, NULL, 0);
			usb_dev_ep_ctl(dev->usb, dev->out_ep, USB_EP_RECV_OK);
			dev->configured = 1;
		} else {
			usb_dev_ep_ctl(dev->usb, dev->in_ep, USB_EP_DISABLE);
			usb_dev_ep_ctl(dev->usb, dev->out_ep, USB_EP_DISABLE);
			usb_dev_ep_ctl(dev->usb, dev->int_ep, USB_EP_DISABLE);
		}
		DCC_LOG(LOG_TRACE, "[CONFIGURED]");
		break;
	}

	case STD_GET_STATUS_DEVICE:
		DCC_LOG(LOG_TRACE, "GetStatusDev");
		*ptr = (void *)&device_status;
		len = 2;
		break;

	case STD_GET_CONFIGURATION:
		DCC_LOG(LOG_TRACE, "GetCfg");
		*ptr = (void *)&dev->configured;
		len = 1;
		break;

#if 0
	case STD_CLEAR_FEATURE_DEVICE:
		if (value == USB_DEVICE_REMOTE_WAKEUP) {
		} else if (value == USB_TEST_MODE ) {
		}
		DCC_LOG(LOG_TRACE, "ClrFeatureDev(%d)", value);
		break;

	case STD_SET_FEATURE_DEVICE:
		if (value == USB_DEVICE_REMOTE_WAKEUP) {
		} else if (value == USB_TEST_MODE ) {
		}
		DCC_LOG(LOG_TRACE, "SetFeatureDev", value);
		break;
#endif

	/* Standard Interface Requests */
	case STD_GET_STATUS_INTERFACE:
		DCC_LOG1(LOG_TRACE, "GetStatusIf(%d)", index);
		*ptr = (void *)&interface_status;
		len = 2;
		break;

#if 0
	case STD_CLEAR_FEATURE_INTERFACE:
		DCC_LOG(LOG_TRACE, "ClrFeatureIf(%d,%d)", index, value);
		break;

	case STD_SET_FEATURE_INTERFACE:
		DCC_LOG(LOG_TRACE, "SetFeatureIf(%d,%d)", index, value);
		break;

	case STD_GET_INTERFACE:
		DCC_LOG(LOG_TRACE, "GetInterface(%d)", index);
		break;

	case STD_SET_INTERFACE:
		DCC_LOG(LOG_TRACE, "SetInterface(%d)", index);
		break;
#endif


	/* Standard Endpoint Requests */
#if 0
	case STD_GET_STATUS_ENDPOINT:
		index &= 0x0f;
		DCC_LOG1(LOG_TRACE, "GetStatusEpt:%d", index);
		break;

	case STD_CLEAR_FEATURE_ENDPOINT:
		index &= 0x0f;
		DCC_LOG1(LOG_TRACE, "ClrFeatureEP:%d", index);
		break;

	case STD_CLEAR_FEATURE_ENDPOINT:
		index &= 0x0f;
		DCC_LOG1(LOG_TRACE, "SetFeatureEP:%d", index);
		break;

	case STD_SYNCH_FRAME:
		index &= 0x0f;
		DCC_LOG1(LOG_TRACE, "SetFeatureEP:%d", index);
		break;
#endif


	/* -------------------------------------------------------------------- 
	 * Class specific requests 
	 */

	case SET_LINE_CODING: 
		{
			struct cdc_line_coding * lc;
			lc = (struct cdc_line_coding *)dev->ctl_buf;
			(void)lc;
			DCC_LOG1(LOG_TRACE, "dsDTERate=%d", lc->dwDTERate);
			DCC_LOG1(LOG_TRACE, "bCharFormat=%d", lc->bCharFormat);
			DCC_LOG1(LOG_TRACE, "bParityType=%d", lc->bParityType);
			DCC_LOG1(LOG_TRACE, "bDataBits=%d", lc->bDataBits);
			break;
		}

