bobmittmann/thinkos/board/stm32f405-dk/src/boot/usb_comm_dual.c
	case GET_LINE_CODING:
		DCC_LOG(LOG_TRACE, "CDC GetLn");
		/* Return Line Coding */
		*ptr = (void *)&usb_cdc_lc;
		len = sizeof(struct cdc_line_coding);
		break;

	case SET_CONTROL_LINE_STATE:
		dev->acm_ctrl = value;
		DCC_LOG2(LOG_TRACE, "CDC_DTE_PRESENT=%d ACTIVATE_CARRIER=%d",
				(value & CDC_DTE_PRESENT) ? 1 : 0,
				(value & CDC_ACTIVATE_CARRIER) ? 1 : 0);
		/* signal monitor */
		dbgmon_signal(DBGMON_COMM_CTL);
		break;

	default:
		DCC_LOG5(LOG_WARNING, "CDC t=%x r=%x v=%x i=%d l=%d",
				req->type, req->request, value, req->index, len);
		break;
	}

	return len;
}

static const usb_dev_ep_info_t usb_mon_ep0_info = {
	.addr = 0,
	.attr = ENDPOINT_TYPE_CONTROL,
	.mxpktsz = EP0_MAX_PKT_SIZE,
	.on_setup = usb_mon_on_setup
};

static void usb_mon_on_reset(usb_class_t * cl)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)cl;
	DCC_LOG(LOG_MSG, "...");
	dev->tx_seq = 0;
	dev->tx_ack = 0;
	dev->rx_seq = 0;
	dev->rx_ack = 0;
	/* clear input buffer */
	dev->rx_cnt = 0;
	dev->rx_pos = 0;
	/* reset control lines */
	dev->acm_ctrl = 0;
	/* initializes EP0 */
	dev->ctl_ep = usb_dev_ep_init(dev->usb, &usb_mon_ep0_info, 
								  dev->ctl_buf, CDC_CTL_BUF_LEN);
}

static void usb_mon_on_suspend(usb_class_t * cl)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)cl;
	DCC_LOG(LOG_TRACE, "...");
	dev->acm_ctrl = 0;
}

static void usb_mon_on_wakeup(usb_class_t * cl)
{
	DCC_LOG(LOG_TRACE, "...");
}

static void usb_mon_on_error(usb_class_t * cl, int code)
{
}

static int usb_comm_send(const void * comm, const void * buf, unsigned int len)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)comm;
	uint8_t * ptr = (uint8_t *)buf;
	unsigned int rem;
	int n;

	if (dev->acm_ctrl == 0) {
		dev->tx_seq = 0;
		dev->tx_ack = 0;
		dev->rx_seq = 0;
		dev->rx_ack = 0;
		/* not connected, discard!! */
		return len;
	}

	rem = len;
	while (rem) {

		DCC_LOG1(LOG_MSG, "usb_dev_ep_pkt_xmit(%d)", rem);
		if (dev->tx_ack != dev->tx_seq) {
			int sig;

			sig = dbgmon_sched_select(1 << DBGMON_COMM_EOT);
			
			if (sig != DBGMON_COMM_EOT) {
				DCC_LOG1(LOG_WARNING, "dbgmon_ched_select(): sig=%d!!", sig);
				dbgmon_signal(sig);
				break;
			}
			DCC_LOG(LOG_MSG, "DBGMON_COMM_EOT");
		}


		dev->tx_seq++;
		n = usb_dev_ep_pkt_xmit(dev->usb, dev->in_ep, ptr, rem);
		if (n > 0) {
#if THINKOS_DBGMON_ENABLE_COMM_STATS
			dev->stats.tx_pkt++;
#endif
			rem -= n;
			ptr += n;
		} else {
#if THINKOS_DBGMON_ENABLE_COMM_STATS
			DCC_LOG1(LOG_WARNING, "usb_dev_ep_pkt_xmit() failed (pkt=%d)!", 
					 dev->stats.tx_pkt);
#else
			DCC_LOG(LOG_WARNING, "usb_dev_ep_pkt_xmit() failed");
#endif
		}

		if (dev->tx_ack != dev->tx_seq) {
			int sig;

			sig = dbgmon_sched_select(1 << DBGMON_COMM_EOT);
			
			if (sig != DBGMON_COMM_EOT) {
				DCC_LOG1(LOG_WARNING, "dbgmon_ched_select(): sig=%d!!", sig);
				dbgmon_signal(sig);
				break;
			}
			DCC_LOG(LOG_MSG, "DBGMON_COMM_EOT");
		}

	}

	DCC_LOG1(LOG_MSG, "return=%d.", len - rem);

	return len - rem;
}

static int usb_comm_recv(const void * comm, void * buf, unsigned int len)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)comm;
	uint32_t ack;
	int pos;
	int cnt;
	int n;

	pos = dev->rx_pos;
	cnt = dev->rx_cnt;
	ack = dev->rx_ack;
	if (pos == cnt) {
		DCC_LOG2(LOG_MSG, "seq=%d ack=%d", dev->rx_seq, dev->rx_ack);
		while (ack == dev->rx_seq) {
			int sig;
			sig = dbgmon_sched_select(1 << DBGMON_COMM_RCV);
			if (sig != DBGMON_COMM_RCV) {
				DCC_LOG1(LOG_WARNING, "dbgmon_ched_select(): sig=%d!!", sig);
				dbgmon_signal(sig);
				return -1;
			}
		}
		cnt = usb_dev_ep_pkt_recv(dev->usb, dev->out_ep, 
								  dev->rx_buf, CDC_EP_IN_MAX_PKT_SIZE);
		dev->rx_ack = ack + cnt;
		dev->rx_cnt = cnt;
		pos = 0;
		DCC_LOG3(LOG_MSG, "usb_dev_ep_pkt_recv: seq=%d ack=%d cnt=%d", 
				 dev->rx_seq, dev->rx_ack, cnt);
		usb_dev_ep_ctl(dev->usb, dev->out_ep, USB_EP_RECV_OK);
	}
	
	/* get data from the rx buffer */
	n = cnt - pos;
	n = MIN(n, len);
	__thinkos_memcpy(buf, &dev->rx_buf[pos], n);
	dev->rx_pos = pos + n;

	return n;
}

static int usb_comm_connect(const void * comm)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)comm;
//	struct cdc_notification * pkt;
//	uint32_t buf[4];

	int ret;

	while ((dev->acm_ctrl & CDC_DTE_PRESENT) == 0) {
		DCC_LOG1(LOG_TRACE, "ctrl=%02x, waiting...", dev->acm_ctrl);
		if ((ret = dbgmon_wait(DBGMON_COMM_CTL)) < 0) {
			DCC_LOG1(LOG_WARNING, "ret=%d!!", ret);
			return ret;
		}
	}

#if 0
	if ((dev->acm.flags & ACM_CONNECTED) == 0) {
		dev->acm.flags |= ACM_CONNECTED;
		pkt = (struct cdc_notification *)buf;
		/* bmRequestType */
		pkt->bmRequestType = USB_CDC_NOTIFICATION;
		/* bNotification */
		pkt->bNotification = CDC_NOTIFICATION_SERIAL_STATE;
		/* wValue */
		pkt->wValue = 0;
		/* wIndex */
		pkt->wIndex = 1;
		/* wLength */
		pkt->wLength = 2;
		/* data */
		pkt->bData[0] = CDC_SERIAL_STATE_TX_CARRIER | 
			CDC_SERIAL_STATE_RX_CARRIER;
		pkt->bData[1] = 0;

		ret = usb_dev_ep_pkt_xmit(dev->usb, dev->int_ep, pkt, 
								  sizeof(struct cdc_notification));
		if (ret < 0) {
			DCC_LOG(LOG_WARNING, "usb_dev_ep_pkt_xmit() failed!");
			return ret;
		}
	}
#endif

	return 0;
}

static bool usb_comm_isconnected(const void * comm)
{
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)comm;
	return (dev->acm_ctrl & CDC_DTE_PRESENT) ? true : false;
}

static void usb_comm_rxflowctrl(const void * comm, bool stop)
{
#if THINKOS_DBGMON_ENABLE_FLOWCTL
	struct usb_cdc_acm_dev * dev = (struct usb_cdc_acm_dev *)comm;
	dev->rx_flowctrl = stop;
	DCC_LOG1(LOG_TRACE, "flowctrl=%s", stop ? "stop" : " start");
#endif
}

static struct usb_cdc_acm_dev usb_cdc_comm_dev;

static const usb_class_events_t usb_mon_ev = {
	.on_reset = usb_mon_on_reset,
	.on_suspend = usb_mon_on_suspend,
	.on_wakeup = usb_mon_on_wakeup,
	.on_error = usb_mon_on_error
};

static const struct dbgmon_comm_op usb_cdc_comm_op = {
	.send = usb_comm_send,
	.recv = usb_comm_recv,
	.connect = usb_comm_connect,
	.isconnected = usb_comm_isconnected,
	.rxflowctrl = usb_comm_rxflowctrl
};

static const struct dbgmon_comm usb_comm_instance = {
	.dev = (void *)&usb_cdc_comm_dev,
	.op = &usb_cdc_comm_op,
};

const struct dbgmon_comm * custom_comm_init(void)
{
	struct usb_cdc_acm_dev * dev = &usb_cdc_comm_dev;
	usb_class_t * cl =  (usb_class_t *)dev;

	/* initialize USB device */
	dev->usb = (usb_dev_t *)&stm32f_otg_fs_dev;
	dev->rx_cnt = 0;
	dev->rx_pos = 0;
	dev->tx_seq = 0; 
	dev->tx_ack = 0; 
	dev->rx_seq = 0;
	dev->rx_ack = 0;
#if THINKOS_DBGMON_ENABLE_FLOWCTL
	dev->rx_flowctrl = false;
	dev->rx_paused = false;
#endif
	dev->configured = 0;

	DCC_LOG(LOG_MSG, "usb_dev_init()");
	usb_dev_init(dev->usb, cl, &usb_mon_ev);

	return &usb_comm_instance;
}

const struct dbgmon_comm * custom_comm_getinstance(void)
{
	return &usb_comm_instance;
}

#endif

